upstream/OpenFOAM-v2606/tutorials/multiphase/interIsoFoam/sphereInReversedVortexFlow/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2606                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    location        "system";
    object          controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     interIsoFoam;

startFrom       startTime;

startTime       0.0;

stopAt          endTime;

endTime         3.0;

writeControl    adjustable;

writeInterval   0.1;

deltaT          0.0025;

purgeWrite      0;

writeFormat     ascii;

writePrecision  14;

writeCompression off;

timeFormat      general;

timePrecision   6;

graphFormat     raw;

runTimeModifiable yes;

adjustTimeStep  no;

maxCo           1e10;

maxAlphaCo      0.5;

maxDeltaT       0.2;


functions
{
    setVelocity
    {
        type            setFlow;
        libs            (fieldFunctionObjects);
        writeControl    writeTime;
        mode            vortex3D;
        scale           cosine;
        scaleCoeffs
        {
            period      6;
            scale       1;
            level       0;
        }
        origin          (0 0 0);
        refDir          (1 0 0);
        axis            (0 1 0);
    }
}


// ************************************************************************* //
